tap "heroku/brew"
tap "homebrew/dupes"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "yonaskolb/xcodegen", "https://github.com/yonaskolb/XcodeGen.git"
brew "python"
brew "awscli"
brew "carthage"
brew "cmatrix"
brew "imagemagick"
brew "gifify"
brew "git"
brew "gpg-agent"
brew "harfbuzz"
brew "node"
brew "heroku"
brew "httpie"
brew "hub"
brew "libiconv"
brew "libxml2"
brew "libxslt"
brew "mas"
brew "python@2"
brew "mongodb", restart_service: true
brew "mysql"
brew "pinentry-mac"
brew "postgresql", restart_service: true
brew "rbenv"
brew "thefuck"
brew "watchman"
brew "wp-cli"
brew "yarn", args: ["without-node"]
brew "youtube-dl"
brew "zsh"
brew "yonaskolb/xcodegen/xcodegen"
cask "1password"
cask "android-platform-tools"
cask "codekit"
cask "dropbox"
cask "emojipedia"
cask "firefoxnightly"
cask "handbrake"
cask "hyper"
cask "qlimagesize"
cask "qlstephen"
cask "webpquicklook"
cask "whiskey"
cask "zoomus"
cask "homebrew/cask-versions/google-chrome-canary"
cask "homebrew/cask-versions/google-chrome-dev"
cask "homebrew/cask-versions/slack-beta"
cask "homebrew/cask-versions/visual-studio-code-insiders"
mas "Battery Health", id: 490192174
mas "Bear", id: 1091189122
mas "Boxy", id: 1053031090
mas "Contrast", id: 1254981365
mas "Expressions", id: 913158085
mas "Gifski", id: 1351639930
mas "HEIC Converter", id: 1294126402
mas "Icon Slate", id: 439697913
mas "iMovie", id: 408981434
mas "Numbers", id: 409203825
mas "Outline", id: 1356178125
mas "Pages", id: 409201541
mas "Redacted", id: 984968384
mas "Squash", id: 1152443474
mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
