tap "sxzz/brew"
tap "timescam/tap"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Record and share terminal sessions
brew "asciinema"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin", restart_service: :changed
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Console Matrix
brew "cmatrix"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Tool for managing dock items
brew "dockutil"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Low-level cryptographic library
brew "nettle"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git blame for file trees
brew "git-who"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg@2.2"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Node version management
brew "n"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Scans and monitors projects for security vulnerabilities
brew "snyk-cli"
# Best command-line tool to install and switch between multiple versions of Xcode
brew "xcodes"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# CLI tool to pay respects
brew "timescam/tap/pay-respects"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Application launcher and productivity software
cask "alfred@4"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Utility for customizing which browser to start
cask "finicky"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Clipboard manager
cask "maccy"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Control your tools with a few keystrokes
cask "raycast"
vscode "1password.op-vscode"
vscode "aaron-bond.better-comments"
vscode "achaq.vercel-theme"
vscode "adamgirton.gloom"
vscode "antfu.file-nesting"
vscode "antfu.icons-carbon"
vscode "antfu.pnpm-catalog-lens"
vscode "antfu.theme-vitesse"
vscode "antfu.treeshake-visualizer"
vscode "architect.architect"
vscode "atomiks.moonlight"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "chaance.night-lights-color-theme"
vscode "christian-kohler.path-intellisense"
vscode "connor4312.esbuild-problem-matchers"
vscode "csstools.postcss"
vscode "daltonmenezes.aura-theme"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dhedgecock.radical-vscode"
vscode "docker.docker"
vscode "dvlpr.dvlpr-theme"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "eshojaei.mbake-makefile-formatter"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hridoy.rails-snippets"
vscode "jamiebradders.skye"
vscode "jock.svg"
vscode "kettanaito.nako"
vscode "ldez.ignore-files"
vscode "leeandher.unofficial-sentry-theme"
vscode "lumaxis.snippet-copy"
vscode "mattpocock.ts-error-translator"
vscode "max-ss.cyberpunk"
vscode "mikestead.dotenv"
vscode "morgan-codes.morgan-codes-vscode-theme"
vscode "motion.motion-vscode-extension"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-twoslash-queries"
vscode "oven.bun-vscode"
vscode "pmndrs.pmndrs"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "raunofreiberg.vesper"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "sdras.inbedby7pm"
vscode "sdras.night-owl"
vscode "sleistner.vscode-fileutils"
vscode "sonarsource.sonarlint-vscode"
vscode "statelyai.stately-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "tailwindlabs.tailwindcss-vscode-theme"
vscode "tamasfe.even-better-toml"
vscode "this-fifo.natty"
vscode "typescriptteam.native-preview"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "webben.browserslist"
vscode "wesbos.theme-cobalt2"
vscode "wicked-labs.sequoia"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
