tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "nektos/tap"
tap "stripe/stripe-cli"
tap "superfly/tap"
tap "teamookla/speedtest"
brew "asimov", restart_service: true
brew "autoconf"
brew "automake"
brew "openssl@1.1"
brew "readline"
brew "awscli"
brew "bat"
brew "carthage"
brew "ccat"
brew "coreutils"
brew "deno"
brew "dog"
brew "libtool"
brew "pkg-config"
brew "ffmpeg"
brew "fish"
brew "gcc"
brew "gh"
brew "gifify"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "libksba"
brew "gnupg"
brew "go"
brew "httpie"
brew "jq"
brew "k6"
brew "libyaml"
brew "mas"
brew "mitmproxy"
brew "n"
brew "pinentry-mac"
brew "ripgrep"
brew "starship"
brew "thefuck"
brew "wget"
brew "youtube-dl"
brew "zlib"
brew "heroku/brew/heroku"
brew "nektos/tap/act"
brew "stripe/stripe-cli/stripe"
brew "superfly/tap/flyctl"
brew "teamookla/speedtest/speedtest"
cask "alacritty"
cask "alfred"
cask "another-redis-desktop-manager"
cask "backblaze"
cask "brave-browser-beta"
cask "clocksaver"
cask "db-browser-for-sqlite"
cask "docker"
cask "eloston-chromium"
cask "emojipedia"
cask "figma"
cask "finicky"
cask "firefox-nightly"
cask "google-chrome-canary"
cask "google-chrome-dev"
cask "graphql-playground"
cask "handbrake"
cask "hyper"
cask "insomnia"
cask "kap"
cask "kid3"
cask "monitorcontrol"
cask "notion"
cask "origin"
cask "rectangle"
cask "rocket"
cask "sketch"
cask "slack-beta"
cask "transmit"
cask "zoom"
cask "zoomus"
mas "1Blocker", id: 1107421413
mas "Contrast", id: 1254981365
mas "DaisyDisk", id: 411643860
mas "Darkroom", id: 953286746
mas "Developer", id: 640199958
mas "Expressions", id: 913158085
mas "Hand Mirror", id: 1502839586
mas "Honey", id: 1472777122
mas "Icon Slate", id: 439697913
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
mas "Link to Text Fragment", id: 1532224396
mas "MeetingBar", id: 1532419400
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paste JSON as Code • quicktype", id: 1330801220
mas "Pastel", id: 413897608
mas "Playgrounds", id: 1496833156
mas "Redacted", id: 984968384
mas "Reeder", id: 1449412482
mas "Spark", id: 1176895641
mas "Squash", id: 1152443474
mas "Tweetbot", id: 1384080005
mas "Twitter", id: 1482454543
mas "Up Next", id: 1355117041
mas "Xcode", id: 497799835
