tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/versions'
brew 'autoconf'
brew 'xz'
brew 'automake'
brew 'libgpg-error'
brew 'libassuan'
brew 'libgcrypt'
brew 'libksba'
brew 'pth'
brew 'dirmngr'
brew 'libpng'
brew 'freetype'
brew 'lame'
brew 'openssl'
brew 'pkg-config'
brew 'x264'
brew 'xvid'
brew 'ffmpeg'
brew 'jpeg'
brew 'libtiff'
brew 'libtool'
brew 'imagemagick'
brew 'gifify'
brew 'libusb'
brew 'libusb-compat'
brew 'gnupg'
brew 'pinentry'
brew 'gpg-agent'
brew 'readline'
brew 'gnupg2'
brew 'hub'
brew 'libyaml'
brew 'pinentry-mac'
brew 'thefuck'
cask '==> Tapping caskroom/cask'
cask 'Tapped 0 formulae (3,491 files, 3.5M)'
cask '==> Creating Caskroom at /usr/local/Caskroom'
cask '==> We'll set permissions properly so we won't need sudo in the future'
